Revit 2027 API
MEPAnalyticalSegment.GetFlowTransitionCharacteristic Method
 Gets the flow transition characteristic of the segment.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FlowTransitionCharacteristic GetFlowTransitionCharacteristic(
	Document doc
)
Public Function GetFlowTransitionCharacteristic (
	doc As Document
) As FlowTransitionCharacteristic
public:
FlowTransitionCharacteristic GetFlowTransitionCharacteristic(
	Document^ doc
)
member GetFlowTransitionCharacteristic :
        doc : Document -> FlowTransitionCharacteristic
Parameters
doc Document
 The document of this segment.
Return Value
FlowTransitionCharacteristic
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
MEPAnalyticalSegment Class
Autodesk.Revit.DB.Analysis Namespace